# ElementsWillBeDeleted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..ElementsWillBeDeleted Property
BuiltInFailures..::..EditingFailures Class See Also
---
Elements in [Design Option] will be deleted
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsWillBeDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsWillBeDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsWillBeDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace